Revit 2026 API

# ExportLayerInfoRemoveLayerModifier Method

---

Removes a project layer modifier from the layer info.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void RemoveLayerModifier(
	LayerModifier layerModifier
)
```
```vb
Public Sub RemoveLayerModifier (
	layerModifier As LayerModifier
)
```
```cpp
public:
void RemoveLayerModifier(
	LayerModifier^ layerModifier
)
```
```fsharp
member RemoveLayerModifier :
        layerModifier : LayerModifier -> unit
```

#### Parameters

layerModifier LayerModifier
     The project layer modifier.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ExportLayerInfo Class

Autodesk.Revit.DB Namespace